#flowchart - არის გრაფიკული დიაგრამა რომელიც გვიჩვენებს როგორ მუშაობს პროგრამა და რა გადაწყვეტილებებია ასევე რა რიგით სრულდება პროგრამა
#sequencing - ინსტრუქციების თანმიმდევრობა რომლის დროსაც პროგრამა სრულდება ნაბიჯ-ნაბიჯ 
#iteration - მოქმედება, რომელიც სრულდება მანამდე, სანამ არ დააგმაყოფილებს მითითებებს
#selection - არჩევანი, რომელსაც პროგრამა აკეთებს პროგრამაში პირობების გათვალისწინებით
#ზოგადი ფორმულა F = (C * 9/5) + 32 ავიღოთ ამ დროინდელი ტემპერატურა (9)


C=9
F=print( (C * 9/5) + 32)
print(F)

word= "programming"
x=word[2:8]
print(x)