#კომენტარი არის აკრეფილი ტექსტი რომელსაც python  არ აღიქვამს ეს არის მხოლოდ ადამიანებისთვის 
#case-sensitive ნიშნავს ყოველ ცვლილებაზე სხვა რაღაცის აღქმა მაგალითად თუ ცვლადში გვაქვს დიდი ასო სადმე ან არის ოდნავ მაინც განსხვავებული სიტყვა მაშინ მნიშვნელობა ერთი არ არის
#snake-case არის წერის სტილი რომელიც მარტივს ხდის დაპრინტულის წაკითხვას ამ დროს ჩვენ ვიყენებს პატარა ასოებს და ქვედა ტირეებით ვყობთ სიტყვებს

first_name = "zuka"
last_name = "kakhniashvili"

print("my " + "name " + "is " + (first_name) + " and "  + "my " + "last " + "name " + "is  " + (last_name) )

#bug არის სისტემაში შეცდომა ხოლო debugging არის სისტემაში შეცდომის გასწორება

#print("Hello World) არის არასწორი რადგან მას აკლია ბრჭყალები
print("hello world")

#city -> "London" აქ ჩვენ ვცდილობთ ცვლადის გაკეთებას სადაც არის საჭირო ტოლობის ნიშანი
city = "london"

#pritn(City) აქ ფუნქცია პრინტი არის არასწორად დაწერილი 
print(city)

